# -----------------------------------------------------------------------------
# Этот модуль содержит функции, предоставляющие различную информацию о файле.
# Функция get_mdate(file_path) возвращает дату и время последней
# модификации файла в виде строки.
# Функция get_size(file_path) возвращает размер файла.
# -----------------------------------------------------------------------------


def get_mdate(file_path):
    pass


def get_size(file_path):
    pass


if __name__ == "__main__":
    print("*** module get_file_info.py ***")
