# -----------------------------------------------------------------------------
# Программа выводит список всех файлов, имеющих данное расширение, из
# указанного каталога. Принимает два необязательных аргумента: расширение и
# путь до каталога.
# Если расширение указано как пустая строка "", выводятся все файлы без
# расширения. Если расширение указано как символ "*", выводятся файлы с любым
# расширением. Расширение может быть указано как с точкой, так и без неё
# (например "jpg" и ".jpg" эквивалентны).
# Если путь до каталога не указан, используется текущий каталог
# (из которого запущена программа). Если указан путь до не существующего
# каталога, или это не каталог, выводится соответствующее сообщение и
# программа завершается.
#
#
# -----------------------------------------------------------------------------
